import random_photo from "./photos/random_photo.png";
import chris_photo from "./photos/chris_photo.jpeg";

export const data={
    "employee": {
        "executive": [
            {
                "id": 1,
                "name": "CEO",
                "phone_number": "08475755",
                "photo": random_photo,
                "role": "",
                "department": "임원실"
            },
            {
                "id": 2,
                "name": "홍길동",
                "phone_number": "2084757552",
                "photo": random_photo,
                "role": "",
                "department": "임원실"
            },
            {
                "id": 3,
                "name": "홍길동",
                "phone_number": "08475755",
                "photo": random_photo,
                "role": "",
                "department": "임원실"
            },
            {
                "id": 4,
                "name": "홍길동",
                "phone_number": "2084757552",
                "photo":random_photo,
                "role": "",
                "department": "임원실"
            }
        ],
        "audit": [
            {
                "id": 5,
                "name": "홍길동",
                "phone_number": "2084757552",
                "photo": random_photo,
                "role": "",
                "department": "감사"
            }
        ],
        "finance": [
            {
                "id": 6,
                "name": "홍길동",
                "phone_number": "084757553",
                "photo": random_photo,
                "role": "팀원",
                "department": "경영지원부"
            },
            {
                "id": 7,
                "name": "박",
                "phone_number": "08475755",
                "photo": random_photo,
                "role": "팀원",
                "department": "경영지원부"
            },
            {
                "id": 8,
                "name": "박",
                "phone_number": "08475755",
                "photo": random_photo,
                "role": "팀원",
                "department": "경영지원부"
            },
            {
                "id": 9,
                "name": "홍길동",
                "phone_number": "084757553",
                "photo": random_photo,
                "role": "팀원",
                "department": "경영지원부"
            },
            {
                "id": 10,
                "name": "박",
                "phone_number": "08475755",
                "photo": random_photo,
                "role": "팀원",
                "department": "경영지원부"
            },
            {
                "id": 11,
                "name": "박",
                "phone_number": "08475755",
                "photo": random_photo,
                "role": "팀원",
                "department": "경영지원부"
            },
            {
                "id": 12,
                "name": "홍길동",
                "phone_number": "084757553",
                "photo": random_photo,
                "role": "팀원",
                "department": "경영지원부"
            },
            {
                "id": 13,
                "name": "박",
                "phone_number": "08475755",
                "photo": random_photo,
                "role": "팀원",
                "department": "경영지원부"
            },
            {
                "id": 14,
                "name": "박",
                "phone_number": "08475755",
                "photo": random_photo,
                "role": "팀원",
                "department": "경영지원부"
            }
        ],
        "it_research": [
            {
                "id": 30,
                "name": "홍길동",
                "phone_number": "084757553",
                "photo": random_photo,
                "role": "팀원",
                "department": "개발4팀"
            },
            {
                "id": 40,
                "name": "박",
                "phone_number": "08475755",
                "photo": random_photo,
                "role": "팀원",
                "department": "개발4팀"
            },
            {
                "id": 50,
                "name": "크리스",
                "phone_number": "08475755",
                "photo": chris_photo,
                "role": "팀원",
                "department": "개발4팀"
            }
        ]
    },
    "announcement": [
        {
            "title": "국내 최초 양산형 초소형군집위성 1호, 해외발사장 이송",
            "description": "과학깃루정보통신부가 한국과학기술원이 국내 최초 양산형 실용위성인 초소형 군집위성 1호 발사를 위해 29일에 해외발사장으로 이송한다고 밝혔다. 초소형군집위성은 한반도 및 주변 해역을 고빈도로 정밀 감시하고 국가안보 및 재난 재해에 신속히 대응하기 위해 20년부터 KAIS",
            "publication_date": "2024-03-20"
        },
        {
            "title": "한국지엠 창원공장, 정전 76시간 만에 복구…31일부터 생산 재개",
            "description": "한국지엠 창원공장이 정전 76시간 만에 복구됐다. 30일 한국전력 경남본부에 따르면 전날 오후 10시께 한국지엠 창원공장 전력 공급이 재개됐다. 지난 24일 오전 6시께 창원 성산구 삼정변전소에서 전기를 공급받는 한국지엠 지중 송전선로 접속함이 파손된 지 약 76시간",
            "publication_date": "2024-03-10"
        },
        {
            "title": "MS·오픈AI, 130兆 투입해 슈퍼컴퓨터·데이터센터 구축 추진",
            "description": "[파이낸셜뉴스] 마이크로소프트(MS)와 오픈AI가 1000억달러(약 134조6000억원)를 투입해 인공지능(AI) 슈퍼컴퓨터를 포함한 데이터센터를 구축할 계획이라고 정보통신(IT) 전문매체 디인포메이션이 29일(현지시간) 보도했다. 디인포메이션은 소식통 3명을 인용해 MS와 오픈AI 양사의 고위 임원들이 현재 이 같은 계획을 수립하고 있다고 전했다. 양사가 추진 중인 데이터센터의 핵심은 슈퍼컴퓨터로, 오픈AI의 AI 모델을 구동하기 위해 특별히 제작된 수백만개의 서버 칩이 들어갈 예정이다. 이 데이터센터를 구축하는 프로젝트는 '스타게이트(Stargate)'로 불리고, 앞으로 6년에 걸쳐 추진될 것으로 알려졌다. 데이터센터는 여러 공급업체의 다른 칩을 사용하도록 설계될 예정이다. 이 프로젝트에 드는 비용 1000억달러는 MS가 부담할 가능성이 큰 것으로 전해졌다. 이",
            "publication_date": "2024-03-08"
        },
        {
            "title": "\"골프 모임도 네이버에서\" 네이버, MY골프 개편",
            "description": "네이버, 'MY골프'에 라운드 기능 추가 네이버가 동호회, 동문회 등 소규모 골프 모임부터 아마추어 골프 대회의 개설, 모집, 운영, 소통이 가능한 'MY골프'를 출시했다. /그래픽=네이버 제공 네이버가 맞춤형 스포츠 콘텐츠 발굴에 힘을 쏟는다. 동호회, 동문회 등 소규모 골프 모임부터 아마추어 골프 대회의 개설, 모집, 운영, 소통이 가능한 'MY골프'를 출시해 골프 팬들을 끌어들인다. 골프 모임 총무나 대회 운영자는 MY골프 '라운드' 기능을 통해 손쉽게 모임이나 대회를 개설하고 라운드 장소·일정·참가조건 등을 설정할 수 있다. 대회 요강, 참가자 안내사항 등을 공지 사항으로 안내할 수 있으며 조 편성, 참가자 관리, 시상 관리, 후원사 설정 기능도 갖추고 있다. 아마추어 골프 대회의 경우, N Golf에서 대회를 노출하고 참가자를 모집할 수 있다. 지난해 네이버, 대한골프협회, 스마트스코어가 함께 선보인 공인핸디캡을 활용해 공정한 라운드를 진행할 수 있다. 특히 스마트스코어 연동 골프장에서 라운드를 진행할 경우 스코어가 자동으로 연동되고 랭킹이",
            "publication_date": "2024-02-03"
        },
        {
            "title": "국내 최초 양산형 초소형군집위성 1호, 해외발사장 이송",
            "description": "과학깃루정보통신부가 한국과학기술원이 국내 최초 양산형 실용위성인 초소형 군집위성 1호 발사를 위해 29일에 해외발사장으로 이송한다고 밝혔다. 초소형군집위성은 한반도 및 주변 해역을 고빈도로 정밀 감시하고 국가안보 및 재난 재해에 신속히 대응하기 위해 20년부터 KAIS",
            "publication_date": "2024-03-20"
        },
        {
            "title": "한국지엠 창원공장, 정전 76시간 만에 복구…31일부터 생산 재개",
            "description": "한국지엠 창원공장이 정전 76시간 만에 복구됐다. 30일 한국전력 경남본부에 따르면 전날 오후 10시께 한국지엠 창원공장 전력 공급이 재개됐다. 지난 24일 오전 6시께 창원 성산구 삼정변전소에서 전기를 공급받는 한국지엠 지중 송전선로 접속함이 파손된 지 약 76시간",
            "publication_date": "2024-03-10"
        },
        {
            "title": "\"MS·오픈AI, 130兆 투입해 슈퍼컴퓨터·데이터센터 구축 추진\"",
            "description": "[파이낸셜뉴스] 마이크로소프트(MS)와 오픈AI가 1000억달러(약 134조6000억원)를 투입해 인공지능(AI) 슈퍼컴퓨터를 포함한 데이터센터를 구축할 계획이라고 정보통신(IT) 전문매체 디인포메이션이 29일(현지시간) 보도했다. 디인포메이션은 소식통 3명을 인용해 MS와 오픈AI 양사의 고위 임원들이 현재 이 같은 계획을 수립하고 있다고 전했다. 양사가 추진 중인 데이터센터의 핵심은 슈퍼컴퓨터로, 오픈AI의 AI 모델을 구동하기 위해 특별히 제작된 수백만개의 서버 칩이 들어갈 예정이다. 이 데이터센터를 구축하는 프로젝트는 '스타게이트(Stargate)'로 불리고, 앞으로 6년에 걸쳐 추진될 것으로 알려졌다. 데이터센터는 여러 공급업체의 다른 칩을 사용하도록 설계될 예정이다. 이 프로젝트에 드는 비용 1000억달러는 MS가 부담할 가능성이 큰 것으로 전해졌다. 이",
            "publication_date": "2024-03-08"
        },
        {
            "title": "\"골프 모임도 네이버에서\" 네이버, MY골프 개편",
            "description": "네이버, 'MY골프'에 라운드 기능 추가 네이버가 동호회, 동문회 등 소규모 골프 모임부터 아마추어 골프 대회의 개설, 모집, 운영, 소통이 가능한 'MY골프'를 출시했다. /그래픽=네이버 제공 네이버가 맞춤형 스포츠 콘텐츠 발굴에 힘을 쏟는다. 동호회, 동문회 등 소규모 골프 모임부터 아마추어 골프 대회의 개설, 모집, 운영, 소통이 가능한 'MY골프'를 출시해 골프 팬들을 끌어들인다. 골프 모임 총무나 대회 운영자는 MY골프 '라운드' 기능을 통해 손쉽게 모임이나 대회를 개설하고 라운드 장소·일정·참가조건 등을 설정할 수 있다. 대회 요강, 참가자 안내사항 등을 공지 사항으로 안내할 수 있으며 조 편성, 참가자 관리, 시상 관리, 후원사 설정 기능도 갖추고 있다. 아마추어 골프 대회의 경우, N Golf에서 대회를 노출하고 참가자를 모집할 수 있다. 지난해 네이버, 대한골프협회, 스마트스코어가 함께 선보인 공인핸디캡을 활용해 공정한 라운드를 진행할 수 있다. 특히 스마트스코어 연동 골프장에서 라운드를 진행할 경우 스코어가 자동으로 연동되고 랭킹이",
            "publication_date": "2024-02-03"
        },
        {
            "title": "국내 최초 양산형 초소형군집위성 1호, 해외발사장 이송",
            "description": "과학깃루정보통신부가 한국과학기술원이 국내 최초 양산형 실용위성인 초소형 군집위성 1호 발사를 위해 29일에 해외발사장으로 이송한다고 밝혔다. 초소형군집위성은 한반도 및 주변 해역을 고빈도로 정밀 감시하고 국가안보 및 재난 재해에 신속히 대응하기 위해 20년부터 KAIS",
            "publication_date": "2024-03-20"
        },
        {
            "title": "한국지엠 창원공장, 정전 76시간 만에 복구…31일부터 생산 재개",
            "description": "한국지엠 창원공장이 정전 76시간 만에 복구됐다. 30일 한국전력 경남본부에 따르면 전날 오후 10시께 한국지엠 창원공장 전력 공급이 재개됐다. 지난 24일 오전 6시께 창원 성산구 삼정변전소에서 전기를 공급받는 한국지엠 지중 송전선로 접속함이 파손된 지 약 76시간",
            "publication_date": "2024-03-10"
        },
        {
            "title": "\"MS·오픈AI, 130兆 투입해 슈퍼컴퓨터·데이터센터 구축 추진\"",
            "description": "[파이낸셜뉴스] 마이크로소프트(MS)와 오픈AI가 1000억달러(약 134조6000억원)를 투입해 인공지능(AI) 슈퍼컴퓨터를 포함한 데이터센터를 구축할 계획이라고 정보통신(IT) 전문매체 디인포메이션이 29일(현지시간) 보도했다. 디인포메이션은 소식통 3명을 인용해 MS와 오픈AI 양사의 고위 임원들이 현재 이 같은 계획을 수립하고 있다고 전했다. 양사가 추진 중인 데이터센터의 핵심은 슈퍼컴퓨터로, 오픈AI의 AI 모델을 구동하기 위해 특별히 제작된 수백만개의 서버 칩이 들어갈 예정이다. 이 데이터센터를 구축하는 프로젝트는 '스타게이트(Stargate)'로 불리고, 앞으로 6년에 걸쳐 추진될 것으로 알려졌다. 데이터센터는 여러 공급업체의 다른 칩을 사용하도록 설계될 예정이다. 이 프로젝트에 드는 비용 1000억달러는 MS가 부담할 가능성이 큰 것으로 전해졌다. 이",
            "publication_date": "2024-03-08"
        },
        {
            "title": "\"골프 모임도 네이버에서\" 네이버, MY골프 개편",
            "description": "네이버, 'MY골프'에 라운드 기능 추가 네이버가 동호회, 동문회 등 소규모 골프 모임부터 아마추어 골프 대회의 개설, 모집, 운영, 소통이 가능한 'MY골프'를 출시했다. /그래픽=네이버 제공 네이버가 맞춤형 스포츠 콘텐츠 발굴에 힘을 쏟는다. 동호회, 동문회 등 소규모 골프 모임부터 아마추어 골프 대회의 개설, 모집, 운영, 소통이 가능한 'MY골프'를 출시해 골프 팬들을 끌어들인다. 골프 모임 총무나 대회 운영자는 MY골프 '라운드' 기능을 통해 손쉽게 모임이나 대회를 개설하고 라운드 장소·일정·참가조건 등을 설정할 수 있다. 대회 요강, 참가자 안내사항 등을 공지 사항으로 안내할 수 있으며 조 편성, 참가자 관리, 시상 관리, 후원사 설정 기능도 갖추고 있다. 아마추어 골프 대회의 경우, N Golf에서 대회를 노출하고 참가자를 모집할 수 있다. 지난해 네이버, 대한골프협회, 스마트스코어가 함께 선보인 공인핸디캡을 활용해 공정한 라운드를 진행할 수 있다. 특히 스마트스코어 연동 골프장에서 라운드를 진행할 경우 스코어가 자동으로 연동되고 랭킹이",
            "publication_date": "2024-02-03"
        }
    ]
}